import time
import random
import pyautogui
import subprocess
import keyboard as kb

def saper():
    # массив поля, * — пустое поле, # — стена
    pole = [["*","*","*","#","*","*","*","*","*","*","*","*"],
            ["*","*","*","#","*","*","*","*","*","*","*","*"],
            ["*","*","*","#","*","*","*","*","*","*","*","*"],
            ["*","*","*","#","*","*","*","#","#","#","#","#"],
            ["*","*","*","#","#","#","#","#","*","#","*","*"],
            ["*","*","*","#","*","*","*","*","*","#","*","*"],
            ["#","#","#","#","*","*","*","*","*","#","#","#"],
            ["*","*","*","#","*","*","*","*","*","#","*","*"],
            ["*","*","*","#","*","*","*","*","*","#","*","*"],
            ["*","*","*","#","*","*","*","*","*","#","*","*"],
            ["*","*","*","#","*","*","*","*","*","#","*","*"],
            ["*","*","*","#","*","*","*","*","*","#","*","*"]]

    # то, что будет выводиться на экран
    vidimost_polya=[["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"],
                    ["•","•","•","•","•","•","•","•","•","•","•","•"]]

    # вывод поля на экран, для любого, абстрактного списка будет работать


    def vyvodPolya(spisok):
        for stroka in spisok:
            for kletka in stroka:
                print(kletka,end='')
            print()
        
        
    # проверка поля на то, что внутри него
    # если поле пустое, проверяются все клетки вокруг него
    # если стена — не проверяются
    # если поле уже было открыто — оно не проверяется

    def check(stroka,stolb):
        # если клетка ещё не открыта
        if vidimost_polya[stroka][stolb] == "•":
            # открываем
            vidimost_polya[stroka][stolb] = pole[stroka][stolb]
            # если оно оказалось пустым
            if pole[stroka][stolb] == "*":
                # проверяем все соседние, только если они существуют
                # а то выйдем за пределы поля, Python ругать будет
                if stroka-1 >= 0:
                    check(stroka-1,stolb)
                    if stolb-1 >= 0:
                        check(stroka-1,stolb-1)
                    if stolb+1 < len(pole[stroka]):
                        check(stroka-1,stolb+1)
                    
                if stroka+1 < len(pole):
                    check(stroka+1,stolb)
                    if stolb-1 >= 0:
                        check(stroka+1,stolb-1)
                    if stolb+1 < len(pole[stroka]):
                        check(stroka+1,stolb+1)
                    
                if stolb-1 >= 0:
                        check(stroka,stolb-1)
                if stolb+1 < len(pole[stroka]):
                    check(stroka,stolb+1)
                
                
                
    # добавим проверку, остались ли ещё неоткрытые элементы поля
    # функция будет возвращать True, если больше нет
    # и False, если ещё остались

    def isOpen():
        # считаем, что поле открыто всё
        opened = True
        #для каждой строки в видимости поля
        for stroka in vidimost_polya:
            # если хотя бы в одной нашлось закрытое поле
            if "•" in stroka:
                # значит неправда, поле ещё не всё открыто
                opened = False
        return opened

#def shipwar():
    
    
def catcher():
    place = [[' ',' ',' ',' ',' ',' '],
             [' ',' ',' ',' ',' ',' '],
             [' ',' ',' ',' ',' ',' '],
             [' ',' ',' ',' ',' ',' '],
             [' ',' ',' ',' ',' ',' '],
             [' ',' ',' ','_',' ',' ']]

    lockedPoint = 0
    ying0 = 0
    ying = -1
    xP = 3
    point = [0,1,2,3,4,5]
    
    print("что бы закончить нажмите на R")
    time.sleep(1)
    print('3')
    time.sleep(1)
    print('2')
    time.sleep(1)
    print('1')
    time.sleep(1)
    
    while True:
        # player [5][3]
            
        # для удаления палок
        x0 = xP
        
        
        # управление
        if kb.is_pressed('A'):
            xP -= 1
        elif kb.is_pressed('D'):
            xP += 1
        elif kb.is_pressed('R'):
            break
        else:
            xP = xP
            
        # "стены"
        if xP == -1:
            xP += 1
        elif xP == 6:
            xP -= 1

        # движения игрока
        else:
            place[5][x0] = ' '
            place[5][xP] = '_'
            
            
        ying0 = ying
                    
        # очки спускаются
        ying += 1
        place[ying][lockedPoint] = '*'
        place[ying0][lockedPoint] = ' '   
        
        # попадает
        if '*' in place[5] and '*' in place[5][xP]:
            ying = -1
            lockedPoint = random.choice(point)
            place[5][xP] = '_'
            print("красава")
            
        # не попадает
        elif '*' in place[5] and '*' not in place[5][xP]:
            print('бывает')
            ying = -1
            place[5][lockedPoint] = ' '
            lockedPoint = random.choice(point)            
            
            
        # вывод таблицы через 1 секунду
        for i in place:
            for y in i:
                print(y, end='')
            print()
        time.sleep(1)
        print("______")
              


questions1 = ['крепастное право отменил Александр II?', 'крепостное право отменили в 1869 году?', 'первый телефон появился в 1876?']
questions2 = ['люди начали делать музыку в эпоху Античности?', 'первые компьютерные игры созданны в 1930 годах?', 'официально доказали что земля круглая в 1543 году?']
questions3 = ['Юрий Гагарин полетел в космос в 1967 году?', 'NASA основали в 1958 году?', 'последний открытый бозон "Хиггса" был открыт в 2005 году?']
questions4 = ['лампочку создал Томас Эдисон в 1879 году?', 'человек попал на луну в 1966 году?', '']
q1 = False
q2 = False
q3 = False
q4 = False

print("Здравствуйте, я бот для игр, записей и поиска")
time.sleep(1)
print('прошу, если вы открываете меня первый раз то ознакомьтесь с функциями при помощи команды "help"')
time.sleep(1)
lst1 = ['"saper" - игра в сапёра', '"catcher" - игра в поймай звезду', '"R or L" - игра в правду или лож', '"ShipWar" - морской бой', '"write" - записать в саписки', '"read" - прочитать записки', '"SawIt" - просмотр названий созданных записок', '"search" - поиск в интернете', '"open" - открыть приложение на компьютере (ТРЕБУЕТСЯ ССЫЛКА)']
d = dict()
read = list()


Enter = input('впишите команду: ')
while Enter != 'quit':
    if Enter == 'help':
        for i in range(len(lst1)):
            print(lst1[i])
        Enter = input('впишите команду: ')
        
    if Enter == 'saper':
        saper()
        Enter = input('впишите команду: ')
    
    if Enter == 'catcher':
        catcher()
        Enter = input("хорошая игра. что дальше?: ")
    
    if Enter == 'write':
        a = input("назовите записку: ")
        read.append(a)
        print(" ")
        print("записка создана")
        print(" ")
        b = input()
        d[a] = list()
        d[a].append(b)
        Enter = input('впишите команду: ')
        
    if Enter == 'read':
        reed = input("какую записку вы хотите посмотреть: ")
        for i in range(len(d[reed])):
            print(d[reed][i])
        Enter = input('впишите команду: ')
    
    if Enter == "SawIt":
        for i in range(len(read)):
            print(read[i])
        Enter = input('впишите команду: ')
        
    if Enter == "R or L":
        